In [6]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "age": [25, np.nan, 41, 39, np.nan],
    "income": [50_000, 62_000, np.nan, 70_000, 65_000],
    "city": ["A", "A", "B", np.nan, "B"]
})

display(df)

# Среднее для income
df["income"] = df["income"].fillna(df["income"].mean())

# Медиана для age
df["age"] = df["age"].fillna(df["age"].median())

# Мода для city (если несколько мод — берем первую)
df["city"] = df["city"].fillna(df["city"].mode().iloc[0])

# Групповая медиана age по city
# df["age"] = df["age"].fillna(
    # df.groupby("city")["age"].transform("median")
# )

display(df)

    age   income city
0  25.0  50000.0    A
1   NaN  62000.0    A
2  41.0      NaN    B
3  39.0  70000.0  NaN
4   NaN  65000.0    B

    age   income city
0  25.0  50000.0    A
1  39.0  62000.0    A
2  41.0  61750.0    B
3  39.0  70000.0    A
4  39.0  65000.0    B

In [8]:
df.groupby("city")["age"].transform("median")

0    39.0
1    39.0
2    40.0
3    39.0
4    40.0
Name: age, dtype: float64